Fix: dead code removed and fix added
